{
  "name": "Kasi Majji",
  "title": "Data Scientist & Machine Learning Engineer",
  "profilePhoto": "/images/profile-photo.png",
  "shortBio": "Passionate Data Scientist with expertise in machine learning, deep learning, and data engineering. Solving complex problems through data-driven approaches.",
  "socialLinks": {
    "github": "https://github.com/kasimajji",
    "linkedin": "https://linkedin.com/in/kasi-majji",
    "twitter": "https://twitter.com/kasimajji",
    "email": "kasi.majji24@gmail.com"
  },
  "resumeLink": "/images/DS_KM_github.pdf",
  "introductionVideo": null,
  "aboutMe": "From insurance analytics to real-time ML systems — building data solutions that drive clarity, action, and impact.\n\nHello! I'm Kasi Majji, a Data Scientist and Machine Learning Engineer based in Chicago, IL. With 2.5+ years of experience.\n\nIt didn't start with a dream of becoming a data scientist. It all started with questions. How does Google Photos group faces so perfectly? How do Netflix seem to know what I exactly I Like?  That curiosity slowly turned into passion. I began exploring data, writing code, running models — not because I had to, but because I genuinely loved uncovering insights hidden beneath the surface. Over time, what started as a spark became a full-blown path.\n\nI joined Tata Consultancy Services, where I worked with insurance data. I was helping solve real problems, ones that impacted people and decisions every day. Later, I pursued a master's in information systems at Northern Illinois University to deepen my technical and strategic thinking. That journey gave me the space to experiment, build real-time ML pipelines, explore cloud systems, and bring ideas to life.\n\nMy work lies at the intersection of ML Pipelines, MLOps, and AI — deploying real-time, scalable systems on the cloud. Whether it's cleaning up messy data or deploying production-grade models, I love being hands-on and close to the problem.",
  "journey": "Al & Data Science Practice\n2023-Present\nDelivering intelligent systems for real-world impact across domains like insurance, e-commerce, and customer intelligence\n\nNorthern Illinois University\nMaster's in Management Information Systems | 2023-2025\nFocused on Al systems, cloud computing, data analytics, and advanced statistical modeling\n\nTata Consultancy Services (TCS)\nSoftware Engineer | 2021-2023\nWorked on enterprise applications and quality assurance, laying the foundation for robust, scalable systems\n\nSagi RamaKrishnam Raju Engineering College | SRKR\nElectrical and Electronics Engineering | 2016 - 2020\nWhile my background is in Electrical and Electronics Engineering, I was always drawn to problem-solving through logic, patterns, and data",
  "whatDrivesMe": "Curiosity-Driven Thinking: Inspired by real-world questions - How does Google Photos recognize faces? Why do some recommendations feel made just for me? This mindset fuels my exploration across data science and Al systems.\nFull-Stack ML Craftsmanship: Hands-on with everything from data ingestion and feature engineering to streaming architectures and cloud-native ML deployment. I build systems that work end-to-end.\nValue-Focused Impact: From detection to prediction - I design intelligent solutions that go beyond metrics to deliver real, measurable business outcomes.",
  "beyondTheWork": "I'm deeply passionate about animals (especially dogs and cats), and I find balance through sports like cricket and table tennis.\nI'm also constantly exploring the evolving world of Al research, generative models, and what's next in the ML landscape"
}
